# Задача 3. Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
# **Усложнение.** Вывод оформить в одну строку: числа выводить через запятую. Для этого воспользоваться параметрами функции print
# Примеры/Тесты:
# 10     -> 1,2,4,8,
# 10000  -> 1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,
#
# n = int(input('Введите число: '))
# i = 0
#
# while n >= 2**i:
#     i += 1
#     print(2**(i-1), end=', ')






